/*
 * Machine-reconstructed pseudocode; not original vendor source.
 * Mach-O extent: 0xb3b5a4..0xb3b798 (500 bytes).
 * Function and variable names are synthetic unless documented elsewhere.
 */


long long sub_b3b5a4(long long *a0)
{
    long long v2;  // x0
    long long v3;  // x19
    long long v4;  // x0
    long long v5;  // x0
    long long v6;  // x20
    char *v0;  // [bp-0x10]
    char v1;  // [bp+0x0]

    v0 = &v1;
    v2 = sub_a6ee78();
    if (!v2)
        return 0;
    v3 = v2;
    if ((!a0[2] || sub_a6f344(v3, "encoding")) && (!a0[3] || sub_a6f344(v3, "point-format")))
    {
        if (a0[1])
        {
            if (sub_a6f344(v3, "group"))
                goto LABEL_b3b624;
        }
        else
        {
            if (a0[5] && sub_a6f344(v3, "field-type") && a0[6] && a0[7] && a0[8] && a0[9] && sub_a6f188(v3, L"pg汴彳档潯敳獟杩污g䵈䍁吀卌䜭佒偕琀獬札潲灵渭浡e摡彤牰癯摩牥束潲灵s汴\u2d73牧畯⵰慮敭椭瑮牥慮l汴\u2d73牧畯⵰摩琀獬札潲灵愭杬琀獬札潲灵猭捥戭瑩s汴\u2d73牧畯⵰獩欭浥琀獬洭湩琭獬琀獬洭硡琭獬琀獬洭湩搭汴s汴\u2d73慭\u2d78瑤獬吀卌匭䝉䱁G汴\u2d73楳慧杬渭浡e摡彤牰癯摩牥獟杩污獧琀獬猭杩污ⵧ慩慮渭浡e汴\u2d73楳慧杬挭摯ⵥ潰湩t汴\u2d73楳慧杬猭捥戭瑩s汴\u2d73楳慧杬漭摩琀獬猭杩污ⵧ楳ⵧ慮敭琀獬猭杩污ⵧ楳ⵧ楯d汴\u2d73楳慧杬栭獡\u2d68慮敭琀獬猭杩污ⵧ慨桳漭摩琀獬猭杩污ⵧ敫瑹灹e汴\u2d73楳慧杬欭祥祴数漭摩琀灵敬损b楧彤扣䐀䐀䙅啁呌卟䥕䕔䉟㼀敳灣㔲父㨱猿捥㍰㐸ㅲ䜀㉃㘵A䍇㔲䈶䜀㉃㘵C䍇㔲䐶䜀㕃㈱A䍇ㄵ䈲䜀㕃㈱C捥獤彡敳灣㔲父弱桳㉡㘵䔀䑃䅓匫䅈㔲6捥獤彡敳灣㠳爴弱桳㍡㐸䔀䑃䅓匫䅈㠳4捥獤彡敳灣㈵爱弱桳㕡㈱䔀䑃䅓匫䅈ㄵ2摥㔲ㄵ9摥㐴8捥獤彡桳㉡㐲䔀䑃䅓匫䅈㈲4捥獤彡桳ㅡ䔀䑃䅓匫䅈1捥獤彡牢楡灮潯偬㔲父琱獬㌱獟慨㔲6捥獤彡牢楡灮潯偬㔲父弱桳㉡㘵攀摣慳扟慲湩潰汯㍐㐸ㅲ汴ㅳ弳桳㍡㐸攀摣慳扟慲湩潰汯㍐㐸ㅲ獟慨㠳4捥獤彡牢楡灮潯偬ㄵ爲琱獬㌱獟慨ㄵ2捥獤彡牢楡灮潯偬ㄵ爲弱桳㕡㈱爀慳灟獳牟慳彥桳㉡㘵倀卓匫䅈㔲6獲彡獰彳獲敡獟慨㠳4卐⭓䡓㍁㐸爀慳灟獳牟慳彥桳㕡㈱倀卓匫䅈ㄵ2獲彡獰彳") && sub_a6f188(v3, L"ar⭲眀+⭡眀b扡爀b⭲b⭷b⭡b佐呓匀汥捥䥴瑮牥畲瑰楐数㨺湩瑩⤨映楡敬\u2064湩瀠灩⡥\u2029慣汬\u2000›匀汥捥䥴瑮牥畲瑰楐数㨺湩瑩⤨映楡敬\u2064湩映湣汴⸨⸮\u202c彏低䉎佌䭃\u2029慣汬匀汥捥䥴瑮牥畲瑰楐数㨺湩瑩⤨映楡敬\u2064湩映湣汴⸨⸮\u202e彆䕓乔协䝉䥐䕐\u2029慣汬匀汥捥䥴瑮牥畲瑰楐数㨺湩瑩⤨映楡敬\u2064湩映湣汴⸨⸮\u202c彆䕓乔协䝉䥐䕐\u2029慣汬匀捯敫⁴獩甠楮楮楴污穩摥䌀湡潮⁴牣慥整愠猠捯敫t慃据汥敬d潃湮捥⁴牥潲㩲 䍅䡄ⵅ䍅卄ⵁ䕁ㅓ㠲䜭䵃匭䅈㔲‶䍅䡄ⵅ䍅卄ⵁ䕁㉓㘵䜭䵃匭䅈㠳‴䍅䡄ⵅ䍅卄ⵁ䕁ㅓ㠲匭䅈䔠䑃䕈䔭䑃䅓䄭卅㔲ⴶ䡓⁁䍅䡄ⵅ䍅卄ⵁ䕁ㅓ㠲匭䅈㔲‶䍅䡄ⵅ䍅卄ⵁ䕁㉓㘵匭䅈㠳‴䍅䡄ⵅ卒ⵁ䕁ㅓ㠲䜭䵃匭䅈㔲‶䍅䡄ⵅ卒ⵁ䕁㉓㘵䜭䵃匭䅈㠳‴䍅䡄ⵅ卒ⵁ䕁ㅓ㠲匭䅈䔠䑃䕈刭䅓䄭卅㔲ⴶ䡓⁁䍅䡄ⵅ卒ⵁ䕁ㅓ㠲匭䅈㔲‶䍅䡄ⵅ卒ⵁ䕁㉓㘵匭䅈㠳‴䡄ⵅ卒ⵁ䕁ㅓ㠲䜭䵃匭䅈㔲‶䡄ⵅ卒ⵁ䕁㉓㘵䜭䵃匭䅈㠳‴䡄ⵅ卒ⵁ䕁ㅓ㠲匭䅈䐠䕈刭䅓䄭卅㔲ⴶ䡓⁁䡄ⵅ卒ⵁ䕁ㅓ㠲匭䅈㔲‶䡄ⵅ卒ⵁ䕁㉓㘵匭䅈㔲‶䕁ㅓ㠲匭䅈伀数卮䱓映楡敬\u2064\u202d潣湮捥楴湯映楡畬敲伀数卮䱓映楡敬\u2064\u202d㕸㤰攠牲牯伀数卮䱓映楡敬\u2064\u202d伀数卮䱓映楡敬\u2064\u202d敲散癩摥攠牡祬䔠䙏伀数卮䱓映楡敬\u2064\u202d湵敤汲楹杮䈠佉爠灥牯整\u2064湡䤠伯攠牲牯伀数卮䱓映楡敬\u2064\u202d牥\u2072潮敮伀数", a0[7]) && sub_a6f188(v3, "b", a0[8]) && sub_a6f188(v3, "order", a0[9]) && (!a0[10] || sub_a6f188(v3, "cofactor")) && (!a0[12] || sub_a6f460(v3, "seed")) && a0[11] && sub_a6f460(v3, "generator"))
            {
LABEL_b3b624:
                v4 = sub_a6f570(v3);
                if (!v4)
                {
                    sub_a71e38(v4);
                    sub_a6eed4(v3);
                    return 0;
                }
                v5 = sub_a1bda8();
                if (v5)
                {
                    sub_a1a174(a0[16]);
                    a0[16] = v5;
                    v6 = 1;
                }
                else
                {
                    v6 = 0;
                }
                sub_a71e38(v4);
                sub_a6eed4(v3);
                return v6;
            }
        }
    }
    sub_a71e38(0);
    sub_a6eed4(v3);
    return 0;
}
